In [ ]:
# ! python3 -m pip install ipython-sql
# ! python3 -m pip install jupyterlab
# # https://pypi.python.org/pypi/ipython-sql

In [ ]:
# dialect+driver://username:password@host:port/database

In [1]:
%load_ext sql

In [2]:
%%sql sqlite:///foo1.db
CREATE TABLE writer (first_name, last_name, year_of_death);

Done.

[]

In [3]:
%%sql
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1956);
INSERT INTO writer VALUES ('Wes', 'McKinney', Null);

 * sqlite:///foo1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql
SELECT * FROM writer

 * sqlite:///foo1.db
Done.

[('William', 'Shakespeare', 1616),
 ('Bertold', 'Brecht', 1956),
 ('Wes', 'McKinney', None)]

In [5]:
%%sql
select first_name, last_name from writer

 * sqlite:///foo1.db
Done.

[('William', 'Shakespeare'), ('Bertold', 'Brecht'), ('Wes', 'McKinney')]

In [7]:
%%sql
select first_name as Name, last_name as Surname from writer

 * sqlite:///foo1.db
Done.

[('William', 'Shakespeare'), ('Bertold', 'Brecht'), ('Wes', 'McKinney')]

In [9]:
%%sql
select * from writer

 * sqlite:///foo1.db
Done.

[('William', 'Shakespeare', 1616),
 ('Bertold', 'Brecht', 1956),
 ('Wes', 'McKinney', None)]

In [15]:
%%sql
select COUNT(first_name) from writer where year_of_death between 1600 and 2000

 * sqlite:///foo1.db
Done.

[(2,)]

In [16]:
result = %sql SELECT * FROM writer WHERE year_of_death > 1605

 * sqlite:///foo1.db
Done.

In [17]:
type(result)

sql.run.ResultSet

In [20]:
dataframe = result.DataFrame() #we'll see dataframes/pandas next week!

In [21]:
type(dataframe)

pandas.core.frame.DataFrame

In [ ]:
%matplotlib inline
import seaborn as sns

In [ ]:
result.bar()

In [34]:
%%sql
SELECT * FROM writer

 * sqlite:///foo1.db
Done.

[('Wes', 'McKinney', None), ('Anuj', 'Garg', None), ('Mohit', 'Sharma', None)]

In [23]:
%%sql
UPDATE writer SET year_of_death = 2020 WHERE last_name="Shakespeare";

 * sqlite:///foo1.db
1 rows affected.

[]

In [30]:
%%sql

DELETE FROM writer WHERE year_of_death = 0;

 * sqlite:///foo1.db
0 rows affected.

[]

In [33]:
%%sql

INSERT INTO writer ('last_name', 'first_name') VALUES ("Sharma", "Mohit")

 * sqlite:///foo1.db
1 rows affected.

[]